## Plan Result (stg-frontendappgateway)




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.frontendappgateway.azurerm_application_gateway.ag[0]
  * module.frontendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.frontendappgateway.azurerm_public_ip.app_gw[0]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.frontendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories[0] will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.frontendappgateway.azurerm_application_gateway.ag[0] will be created
  + resource "azurerm_application_gateway" "ag" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "cft-aks-fe-00-aat-agw"
      + resource_group_name = "cft-aat-network-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
      + zones               = [
          + "1",
          + "2",
          + "3",
        ]

      + autoscale_configuration {
          + max_capacity = 10
          + min_capacity = 2
        }

      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "plum"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "div-dn"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "div-da"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "div-rfe"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "div-pfe"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "pet-app1"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "pet-app2"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "sscs-tribunals"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "sscs-cor"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "sscs-tya"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "xui-webapp"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "xui-manage-org"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "xui-approve-org"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "xui-register-org"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "civil-citizen-ui"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "cmc"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "cmc-legal"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "fact"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "fact-admin"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "rpts"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "nfdiv"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "nfdiv-apply"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "nfdiv-civil"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "et-sya"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ia-aip"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "wa-proto-frontend"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "gateway-ccd"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "return-case-doc-ccd"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "pcq"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "lau"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "adoption"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "adoption-web"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "probate"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "idam-web-public"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "paybubble"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "bar"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "fees-register"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "idam-web-admin"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "idam-user-dashboard"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "reformscan"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "reformscanstg"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "ds-ui"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "fis-ds-web"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "privatelaw"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "hmi-apim"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "cft-api-mgmt"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.10.143.250",
              + "10.10.159.250",
            ]
          + name         = "paymentoutcome-web"
        }

      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "plum"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "plum"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "div-dn"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "div-dn"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "div-da"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "div-da"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "div-rfe"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "div-rfe"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "div-pfe"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "div-pfe"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "pet-app1"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "pet-app1"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "pet-app2"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "pet-app2"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "sscs-tribunals"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "sscs-tribunals"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "sscs-cor"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "sscs-cor"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "sscs-tya"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "sscs-tya"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "xui-webapp"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "xui-webapp"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "xui-manage-org"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "xui-manage-org"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }
      + backend_http_settings {
          + cookie_based_affinity               = "Disabled"
          + id                                  = (known after apply)
          + name                                = "xui-approve-org"
          + pick_host_name_from_backend_address = false
          + port                                = 80
          + probe_id                            = (known after apply)
          + probe_name                          = "xui-approve-org"
          + protocol                            = "Http"
          + request_timeout                     = 30
        }


# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

          = (known after apply)
          + http_listener_name         = "nfdiv-apply"
          + id                         = (known after apply)
          + name                       = "nfdiv-apply"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "nfdiv-civil"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "nfdiv-civil"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "nfdiv-civil"
          + id                         = (known after apply)
          + name                       = "nfdiv-civil"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "paybubble"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "paybubble"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "paybubble"
          + id                         = (known after apply)
          + name                       = "paybubble"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "paymentoutcome-web"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "paymentoutcome-web"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "paymentoutcome-web"
          + id                         = (known after apply)
          + name                       = "paymentoutcome-web"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "pcq"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "pcq"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "pcq"
          + id                         = (known after apply)
          + name                       = "pcq"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "pet-app1"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "pet-app1"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "pet-app1"
          + id                         = (known after apply)
          + name                       = "pet-app1"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "pet-app2"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "pet-app2"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "pet-app2"
          + id                         = (known after apply)
          + name                       = "pet-app2"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "plum"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "plum"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "plum"
          + id                         = (known after apply)
          + name                       = "plum"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "privatelaw"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "privatelaw"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "privatelaw"
          + id                         = (known after apply)
          + name                       = "privatelaw"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "probate"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "probate"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "probate"
          + id                         = (known after apply)
          + name                       = "probate"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "reformscan"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "reformscan"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "reformscan"
          + id                         = (known after apply)
          + name                       = "reformscan"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "reformscanstg"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "reformscanstg"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "reformscanstg"
          + id                         = (known after apply)
          + name                       = "reformscanstg"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "return-case-doc-ccd"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "return-case-doc-ccd"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "return-case-doc-ccd"
          + id                         = (known after apply)
          + name                       = "return-case-doc-ccd"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rpts"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rpts"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rpts"
          + id                         = (known after apply)
          + name                       = "rpts"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-cor"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-cor"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-cor"
          + id                         = (known after apply)
          + name                       = "sscs-cor"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-tribunals"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-tribunals"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-tribunals"
          + id                         = (known after apply)
          + name                       = "sscs-tribunals"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-tya"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-tya"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-tya"
          + id                         = (known after apply)
          + name                       = "sscs-tya"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "wa-proto-frontend"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "wa-proto-frontend"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "wa-proto-frontend"
          + id                         = (known after apply)
          + name                       = "wa-proto-frontend"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "xui-approve-org"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "xui-approve-org"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "xui-approve-org"
          + id                         = (known after apply)
          + name                       = "xui-approve-org"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "xui-manage-org"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "xui-manage-org"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "xui-manage-org"
          + id                         = (known after apply)
          + name                       = "xui-manage-org"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "xui-register-org"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "xui-register-org"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "xui-register-org"
          + id                         = (known after apply)
          + name                       = "xui-register-org"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "xui-webapp"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "xui-webapp"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "xui-webapp"
          + id                         = (known after apply)
          + name                       = "xui-webapp"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rewrite_rule_set_name      = "x_fwded_proto"
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + rewrite_rule_set {
          + id   = (known after apply)
          + name = "x_fwded_proto"

          + rewrite_rule {
              + name          = "x_fwded_proto"
              + rule_sequence = 100

              + request_header_configuration {
                  + header_name  = "X-Forwarded-Proto"
                  + header_value = "https"
                }
              + request_header_configuration {
                  + header_name  = "X-Forwarded-Port"
                  + header_value = "443"
                }
              + request_header_configuration {
                  + header_name  = "X-Forwarded-For"
                  + header_value = "{var_add_x_forwarded_for_proxy}"
                }
            }
        }

      + sku {
          + name = "Standard_v2"
          + tier = "Standard_v2"
        }

      + ssl_policy {
          + cipher_suites        = (known after apply)
          + disabled_protocols   = (known after apply)
          + min_protocol_version = (known after apply)
          + policy_name          = (known after apply)
          + policy_type          = (known after apply)
        }
    }

  # module.frontendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-nonprod"
      + name                       = "AppGw"
      + target_resource_id         = (known after apply)

      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.frontendappgateway.azurerm_public_ip.app_gw[0] will be created
  + resource "azurerm_public_ip" "app_gw" {
      + allocation_method       = "Static"
      + fqdn                    = (known after apply)
      + id                      = (known after apply)
      + idle_timeout_in_minutes = 4
      + ip_address              = (known after apply)
      + ip_version              = "IPv4"
      + location                = "uksouth"
      + name                    = "cft-aks-fe-appgw-aat-pip"
      + resource_group_name     = "cft-aat-network-rg"
      + sku                     = "Standard"
      + tags                    = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "staging"
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":1289,"Program":"tfcmt","SHA1":"","Target":"stg-frontendappgateway","Vars":{}} -->